[TA0005: Defense Evasion: Renamed Powershell.exe]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" Description="Windows Powershell" AND Image!=*\\powershell.exe OR *\\powershell_ise.exe | stats count by Computer,User,ParentImage,Image,CommandLine

[TA0005: Defense Evasion: Renamed CMD.exe]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" Description="Windows Command Processor" AND Image!=*\\cmd.exe | stats count by Computer,User,ParentImage,Image,CommandLine

[TA0005: Defense Evasion: Sysmon Stopped]
search = sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational" EventID=4 AND State!=Started | stats count by UtcTime,host,State

[TA0005: Defense Evasion: Windows Eventlog Cleared]
search = sourcetype="XmlWinEventLog:*" eventid="1102" OR eventid="104" | stats count by host,user,eventid

[TA0005: Defense Evasion: Powershell Execution Bypass]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" (Image=*\\powershell.exe OR Image=*\\powershell_ise.exe OR Description="Windows PowerShell") AND cmdline="*Bypass*" AND cmdline="*-e*"| stats count by Computer,User,ParentImage,Image,CommandLine

[TA0005: Defense Evasion: InstallUtil Applocker Bypass]
search = sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational" Image="*\\InstallUtil.exe"| stats count by Computer,User,ParentImage,Image,CommandLine

[TA0005: Defense Evasion: Defender Real-Time Protection Disabled]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Windows Defender/Operational" EventDescription="Real-time protection is disabled." | table Computer,TimeCreated,EventDescription

[TA0005: Defense Evasion: Defender Exclusion Added]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Windows Defender/Operational" EventDescription="The antimalware platform configuration changed." EventCode=5007 New_Value="*Exclusion*" | table Computer,EventDescription,New_Value

[TA0005: Defense Evasion: Defender Exclusion Added via Powershell]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" (Image="*\\powershell.exe" OR Description="Windows Powershell") AND (CommandLine="*Add-MpPrefer*" AND CommandLine="*Exclusion*") | table Computer,ParentImage,Image,CommandLine
