[TA0007: Discovery: Windows Reconnaissance]
sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" (ParentImage="*powershell*" OR ParentImage="*net.exe" OR ParentImage="*net1.exe" OR ParentImage="*cmd.exe" OR ParentImage="*script.exe") AND (CommandLine="*net*localgroup*" OR CommandLine="*net*user*" OR CommandLine="*net*view*" OR CommandLine="*net*group*" AND CommandLine!="*\\Windows\\Microsoft.NET\\Framework*\\v*\\csc.exe*") OR (CommandLine="*whoami*" OR CommandLine="*systeminfo*" OR CommandLine="*tasklist*" OR CommandLine="*query*user*" OR CommandLine="*net*share*" OR CommandLine="*qwinsta*") OR (Image="*arp.exe" OR Image="*tasklist.exe")| stats count by Computer,User,ParentImage,CommandLine

[TA0007: Discovery: Linux Reconnaissance]
search = index=* sourcetype=cmdhistory AND bash AND ("sudo -l" OR "whoami" OR "uname" OR "groups" OR "/etc/group" OR "/proc/version" OR "/etc/os-release" OR "hostname" OR "/etc/passwd" OR "id")
