[TA0003: Persistence - Scheduled Task Created, Changed, or Deleted]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" (Image="*schtasks.exe" AND CommandLine="*/Create*") OR (Image="*schtasks.exe" AND CommandLine="*/Run*") OR (Image="*schtasks.exe" AND CommandLine="*/Delete*") OR (Image="*schtasks.exe" AND CommandLine="*/Change*") OR Image="*\\at.exe" AND ParentImage!="*root\\Integration\\Integrator.exe" | stats count by Computer,User,ParentImage,CommandLine
--
[TA0003: Persistence: .bash_profile or .bashrc]
search = sourcetype=cmdhistory bash ".bashrc" OR ".bash_profile" | table host,_raw
