[TA0011: Command and Control: Bitsadmin Remote File Download]
sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" Image="*bitsadmin.exe" AND (CommandLine="*/addfile*" OR CommandLine="*/download*" OR CommandLine="*/transfer*" OR CommandLine="*http*") | stats count by Computer,User,ParentImage,CommandLine

[TA0011: Command and Control: Certutil Remote File Download]
Image="*certutil.exe" AND (CommandLine="*-decode*" OR CommandLine="*-ping*" OR CommandLine="*-urldecode*" OR CommandLine="*-urlcache*" OR CommandLine="*-split*") | stats count by Computer,User,CommandLine
